cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    INLET
    {
        type            patch;
        nFaces          107;
        startFace       41713;
    }
    OUTLET
    {
        type            patch;
        nFaces          107;
        startFace       41820;
    }
    TOP
    {
        type            wall;
        inGroups        1(wall);
        nFaces          182;
        startFace       41927;
    }
    BOTTOM
    {
        type            wall;
        inGroups        1(wall);
        nFaces          182;
        startFace       42109;
    }
    CYLINDER
    {
        type            wall;
        inGroups        1(wall);
        nFaces          152;
        startFace       42291;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          42078;
        startFace       42443;
    }
)

// ************************************************************************* //
