cylinder/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
   type                       forceCoeffs;
   libs                       ("libforces.so");
   patches
   (
      CYLINDER
   );

   writeControl              timeStep;
   timeInterval               1;
   
   log                        yes;

   rho                        rhoInf; // Indicates incompressible
   rhoInf                     1; // Redundant for incompressible
   liftDir                    (0 1 0);
   dragDir                    (1 0 0);
   CofR                       (0 0 0);
   pitchAxis                  (0 0 1);
   magUInf                    1;
   lRef                       1.0;
   Aref                       1.0;
}



// ************************************************************************* //
